<?php
##############################################################
# HCコード定義ファイル
# @auther kuroda
##############################################################


// 項目タイプ
$PARAM_TYPE = array(
	"1" => "数値(入力型)",
	"2" => "数値(単一選択型:セレクト)",
	"15" => "数値(単一選択型:ラジオ)",
	"17" => "数値(hidden型)",
	"3" => "小数点有数値",
	"4" => "文字列(入力型)",
	"5" => "文字列(単一選択型:セレクト)",
	"16" => "文字列(単一選択型:ラジオ)",
	"18" => "文字列(hidden型)",
	"20" => "文字列(パスワード型)",
	"6" => "テキスト(入力型)",
	"7" => "テキスト(単一選択型:セレクト)",
	"8" => "テキスト(複数選択型)",
	"14" => "テキスト(wysiwyg型)",
	"9" => "日付",
	"10" => "タイムスタンプ",
	"11" => "画像",
	"12" => "ファイル",
	"13" => "外部キー(単一選択型:セレクト)",
	"19" => "外部キー(hidden型)",
);

// 項目タイプシステムリンク
$PARAM_TYPE_LINK = array(
	"1" => "int_a",
	"2" => "int_b",
	"15" => "int_c",
	"17" => "int_d",
	"3" => "double_a",
	"4" => "string_a",
	"5" => "string_b",
	"16" => "string_c",
	"18" => "string_d",
	"20" => "string_e",
	"6" => "text_a",
	"7" => "text_b",
	"8" => "text_c",
	"14" => "text_d",
	"9" => "date_a",
	"10" => "datetime_a",
	"11" => "file_a",
	"12" => "file_b",
	"13" => "int_key_a",
	"19" => "int_key_b",
);

// 項目タイプカラムリンク
$PARAM_FIELDS_LINK = array(
	"1" => "int",
	"2" => "int",
	"15" => "int",
	"17" => "int",
	"3" => "double",
	"4" => "varchar(255)",
	"5" => "varchar(255)",
	"16" => "varchar(255)",
	"18" => "varchar(255)",
	"20" => "varchar(255)",
	"6" => "text",
	"7" => "text",
	"8" => "text",
	"14" => "text",
	"9" => "date",
	"10" => "datetime",
	"11" => "varchar(255)",
	"12" => "varchar(255)",
	"13" => "int",
	"19" => "int",
);

// MySQL文字コード
$MYSQL_ENCODE = array(
	"SJIS" => "sjis",
	"EUC" => "ujis",
	"UTF-8" => "utf8",
);

// 都道府県情報
$PREFECTURE_CODE = array(
	"1" => "北海道",
	"2" => "青森県",
	"3" => "岩手県",
	"4" => "宮城県",
	"5" => "秋田県",
	"6" => "山形県",
	"7" => "福島県",
	"8" => "茨城県",
	"9" => "栃木県",
	"10" => "群馬県",
	"11" => "埼玉県",
	"12" => "千葉県",
	"13" => "東京都",
	"14" => "神奈川県",
	"15" => "新潟県",
	"16" => "富山県",
	"17" => "石川県",
	"18" => "福井県",
	"19" => "山梨県",
	"20" => "長野県",
	"21" => "岐阜県",
	"22" => "静岡県",
	"23" => "愛知県",
	"24" => "三重県",
	"25" => "滋賀県",
	"26" => "京都府",
	"27" => "大阪府",
	"28" => "兵庫県",
	"29" => "奈良県",
	"30" => "和歌山県",
	"31" => "鳥取県",
	"32" => "島根県",
	"33" => "岡山県",
	"34" => "広島県",
	"35" => "山口県",
	"36" => "徳島県",
	"37" => "香川県",
	"38" => "愛媛県",
	"39" => "高知県",
	"40" => "福岡県",
	"41" => "佐賀県",
	"42" => "長崎県",
	"43" => "熊本県",
	"44" => "大分県",
	"45" => "宮崎県",
	"46" => "鹿児島県",
	"47" => "沖縄県",
);

// 職業情報
$WORK_CODE = array(
	"1" => "公務員",
	"2" => "経営者・役員",
	"3" => "会社員",
	"4" => "自営業・自由業",
	"5" => "専業主婦（主婦）",
	"6" => "パート・アルバイト",
	"7" => "学生",
	"8" => "その他",
	"9" => "無職",
);

// 職種情報
$JOB_CODE = array(
	"1" => "農業・林業・漁業・鉱業",
	"2" => "建設業",
	"3" => "製造業",
	"4" => "電気・ガス・熱供給・水道業",
	"5" => "情報通信業",
	"6" => "運輸業",
	"7" => "卸売・小売業",
	"8" => "金融・保険業",
	"9" => "不動産・物品賃貸業",
	"10" => "宿泊・飲食サービス業",
	"11" => "教育、学習支援、医療、福祉、複合サービス業",
	"12" => "サービス業",
	"13" => "その他",
);

// 最終学歴情報
$EDUCATION_CODE = array(
	"1" => "中学校卒",
	"2" => "高校卒",
	"3" => "専門学校卒",
	"4" => "短大・高専卒業",
	"5" => "大学卒",
	"6" => "大学院卒",
	"7" => "在学中",
	"8" => "その他",
);

// 世帯年収情報
$INCOME_CODE = array(
	"1" => "～400万円",
	"2" => "401万円～600万円",
	"3" => "601万円～800万円",
	"4" => "801万円～1,000万円",
	"5" => "1,001万円～1,200万円",
	"6" => "1,201万円～1,500万円",
	"7" => "1,501万円以上",
);

// 住居形態情報
$HOUSING_CODE = array(
	"1" => "持ち家・一戸建て",
	"2" => "持ち家・マンション",
	"3" => "賃貸・一戸建て",
	"4" => "賃貸・マンション、アパート",
	"5" => "寮・社宅",
	"6" => "その他",
);
